## Plan Result (sbox-aks-mis)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.uami_cft_rg_identity_operator[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.uami_cft_rg_identity_operator[1] will be created
  + resource "azurerm_role_assignment" "uami_cft_rg_identity_operator" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ebd84b84-d1d9-496d-9b29-95068ba77163"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Managed Identity Operator"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/managed-identities-sandbox-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":281,"Program":"tfcmt","SHA1":"","Target":"sbox-aks-mis","Vars":{}} -->